In [1]:
import pandas as pd

In [2]:
data = {'Company':['GooG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Cart','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GooG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Cart    243
5      FB    Sarah    350

Lets Group above data by 'company'

In [7]:
df.groupby('Company')

In [8]:
by_comp = df.groupby('Company')

In [10]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     120.0
GooG     200.0
MSFT     232.0